# read data

## Read data from CSV

In [35]:
import pandas as pd
import numpy as np

In [36]:

file="../TakeHomeChallenge/data/grocery/item_to_id.csv"
data=pd.read_csv(file)
#item as a data frame

In [37]:
data.head()

         Item_name  Item_id
0           coffee       43
1              tea       23
2            juice       38
3             soda        9
4  sandwich loaves       39

### data frame column rename

In [38]:
data2=pd.read_csv(file)
data2.rename(columns={'Item_name':'Item','Item_id':'Id'},inplace=True)
data2.head()

              Item  Id
0           coffee  43
1              tea  23
2            juice  38
3             soda   9
4  sandwich loaves  39

## data read and data merge

In [39]:
user="../TakeHomeChallenge/data\Funnel\\user_table.csv"
home="../TakeHomeChallenge/data\Funnel\home_page_table.csv"
search="../TakeHomeChallenge/data\Funnel\search_page_table.csv"
 
user=pd.read_csv(user,header=0,parse_dates=[1])
home=pd.read_csv(home,header=0) 
search=pd.read_csv(search,header=0)

In [40]:
user.head() #user basic info
home.head() #user list who land on home page
search.head() #user list who land on search page 
d1=home.merge(search,how="left",on="user_id",suffixes=["_home","_search"])
#merge on mutiple indexes 
#result = pd.merge(left, right, on=['key1', 'key2'])

In [41]:
print(d1.shape[0])
#check after data merge, one colume is null 
d1.loc[d1['page_search'].isnull(),:].shape[0]

90400

45200

# python intersect

In [42]:
home.head()
search.head()
pd.Series(list(set(home.user_id).intersection(set(search.user_id)))).head()

len(pd.Series(list(set(home.user_id) & set(search.user_id))))#45200
#home.loc[home['user_id']==917509]
#search.loc[search['user_id']==917509]

45200

# python except

In [43]:
pd.Series(list(set(home.user_id) -set(search.user_id)))

home[~home['user_id'].isin(search ['user_id'])].head() #45200 rows, example user_id =313593

   user_id       page
0   313593  home_page
1   468315  home_page
2   264005  home_page
3   290784  home_page
5   262889  home_page

In [44]:
#verification of above except function in python 
home.loc[home['user_id']==313593]
search.loc[search['user_id']==313593]

Empty DataFrame
Columns: [user_id, page]
Index: []

## Read data from Json

In [45]:
import json
json_data=open("../TakeHomeChallenge/data/song.json").read()

jsdata = json.loads(json_data)
#data as a list
js_df=pd.DataFrame(jsdata)
music=js_df
#df as a data frame

## read data from online-beautiful soup

In [46]:
html_doc = """
<html><head><title>The Dormouse's story</title></head>
<body>
<p class="title"><b>The Dormouse's story</b></p>

<p class="story">Once upon a time there were three little sisters; and their names were
<a href="http://example.com/elsie" class="sister" id="link1">Elsie</a>,
<a href="http://example.com/lacie" class="sister" id="link2">Lacie</a> and
<a href="http://example.com/tillie" class="sister" id="link3">Tillie</a>;
and they lived at the bottom of a well.</p>

<p class="story">...</p>
"""
from bs4 import BeautifulSoup
soup = BeautifulSoup(html_doc, 'html.parser')

print(soup.prettify())

<html>
 <head>
  <title>
   The Dormouse's story
  </title>
 </head>
 <body>
  <p class="title">
   <b>
    The Dormouse's story
   </b>
  </p>
  <p class="story">
   Once upon a time there were three little sisters; and their names were
   <a class="sister" href="http://example.com/elsie" id="link1">
    Elsie
   </a>
   ,
   <a class="sister" href="http://example.com/lacie" id="link2">
    Lacie
   </a>
   and
   <a class="sister" href="http://example.com/tillie" id="link3">
    Tillie
   </a>
   ;
and they lived at the bottom of a well.
  </p>
  <p class="story">
   ...
  </p>
 </body>
</html>

In [47]:
soup.title
soup.find_all('a')
for link in soup.find_all('a'):
    print(link.get('href'))
    
print(soup.get_text())

http://example.com/elsie
http://example.com/lacie
http://example.com/tillie

The Dormouse's story

The Dormouse's story
Once upon a time there were three little sisters; and their names were
Elsie,
Lacie and
Tillie;
and they lived at the bottom of a well.
...

## get a list

In [48]:
list=[i for i in range(10)]#create a list
list

list2=[i for i in range(3,16)]#create a list
#get elements in one list but not ther other
set(list)-set(list2)

{0, 1, 2}

## define a dictionary

In [49]:
dict={}
dict={"a":1,"b":2}
#dict["a"] #get value from dictionary based on key value
for i in dict:
    print("dict key is {0} value is {1}".format(i,dict[i]))

for i in dict.items():
    print("dict item is {0}".format(i)) 
for i in dict.values():
    print("dict value is {0}".format(i))  
for i in dict.keys():
    print("dict key is {0}".format(i))

dict key is a value is 1
dict key is b value is 2
dict item is ('a', 1)
dict item is ('b', 2)
dict value is 1
dict value is 2
dict key is a
dict key is b

# data query

## get sample value from data frame

In [50]:
data.head()
data.tail()
data.sample(5)#default returns one record, takes parameters

        Item_name  Item_id
42        shampoo       12
45  shaving cream       19
2           juice       38
7          bagels       13
10        ketchup       41

## get row count from data frame, list, array

In [51]:
data.shape[0]#row count of data frame
len(data) #row count of data frame or list

len(list)#item count of list

10

## data query by columns

In [52]:
data.head()

         Item_name  Item_id
0           coffee       43
1              tea       23
2            juice       38
3             soda        9
4  sandwich loaves       39

In [53]:
data.head()
data['Item_name']#query by column name
#df.loc[row_indexer,column_indexer]
data.loc[:,'Item_name']#query by column name
data.loc[0,'Item_name']#query by column name, and row index 
#data.loc[0,data['Item_name']!='']#query by column name, and row index 

data.iloc[:,1]#iloc query, query by numeric

0     43
1     23
2     38
3      9
4     39
5     37
6     34
7     13
8     28
9     26
10    41
11    21
12    14
13    16
14    48
15     8
16    11
17    30
18     1
19    31
20     5
21    22
22    36
23     6
24    17
25    47
26    46
27    40
28    25
29    20
30    32
31    44
32    10
33    45
34    42
35     2
36    18
37    27
38    24
39    33
40    15
41     7
42    12
43    35
44    29
45    19
46     4
47     3
Name: Item_id, dtype: int64

## data query by rows

In [54]:
data.loc[1,:] #query row by index

Item_name    tea
Item_id       23
Name: 1, dtype: object

## data query by sepcific condition

In [55]:
data.loc[data['Item_name']=="coffee",:] #query by specific condition

  Item_name  Item_id
0    coffee       43

In [56]:
data.loc[(data['Item_name']!="coffee") & (data['Item_name']=="tea"),:] #query by specific condition

  Item_name  Item_id
1       tea       23

# NULL query

In [57]:
#check whether values is null or not in data frame 
pd.notnull(data['Item_name']).value_counts()

True    48
Name: Item_name, dtype: int64

data['Item_name'].value_counts()

## index related operations

In [58]:
data_idx=data.set_index("Item_id")
#data_idx.head()

data_idx.reset_index() #reset index, and make current index as a column
data_idx.reset_index(drop=True)#reset index, and drop previous index

            Item_name
0              coffee
1                 tea
2               juice
3                soda
4     sandwich loaves
5        dinner rolls
6           tortillas
7              bagels
8   canned vegetables
9     spaghetti sauce
10            ketchup
11            cheeses
12               eggs
13               milk
14             yogurt
15             butter
16            cereals
17              flour
18              sugar
19              pasta
20            waffles
21  frozen vegetables
22          ice cream
23            poultry
24               beef
25               pork
26            bananas
27            berries
28           cherries
29         grapefruit
30             apples
31           broccoli
32            carrots
33        cauliflower
34          cucumbers
35            lettuce
36  laundry detergent
37       dishwashing
38       paper towels
39       toilet paper
40      aluminum foil
41      sandwich bags
42            shampoo
43               soap
44          hand soap
45      shaving cream
46         baby items
47          pet items

# Data aggregation

## Group by

In [59]:
music.head()

,id,song_played,time_played,user_id,user_sign_up_date,user_state
0,GOQMMKSQQH,Hey Jude,2015-06-11 21:51:35,122,2015-05-16,Louisiana
1,HWKKBQKNWI,We Can Work It Out,2015-06-06 16:49:19,3,2015-05-01,Ohio
2,DKQSXVNJDH,Back In the U.S.S.R.,2015-06-14 02:11:29,35,2015-05-04,New Jersey
3,HLHRIDQTUW,P.s. I Love You,2015-06-08 12:26:10,126,2015-05-16,Illinois
4,SUKJCSBCYW,Sgt. Pepper's Lonely Hearts Club Band,2015-06-28 14:57:00,6,2015-05-01,New Jersey

In [102]:
#group by and find out aggregated values 
pop_music=music.groupby("song_played").size()
pop_music.sort_values(ascending=False).head()
#type(pop_music)#series

song_played
Come Together        408
Revolution           321
Get Back             279
Let It Be            184
A Day In The Life    170
dtype: int64

count instance by certain attributes

In [99]:
music['song_played'].value_counts().reset_index().rename(columns={'index': 'song', 'song_played': 'count'}).head()

                song  count
0      Come Together    408
1         Revolution    321
2           Get Back    279
3          Let It Be    184
4  A Day In The Life    170

In [103]:
#group by and get distinct value count 

def getUniqCnt(ser):
    #return(len(np.unique(ser)));
    return(len(ser.unique()))
music.groupby(["user_state"])["user_id"].apply(getUniqCnt).head()

user_state
Alabama        4
Alaska         2
Arizona        1
Arkansas       2
California    21
Name: user_id, dtype: int64

In [104]:
music.groupby(["user_state"]).user_id.apply(getUniqCnt).head()

user_state
Alabama        4
Alaska         2
Arizona        1
Arkansas       2
California    21
Name: user_id, dtype: int64

# unique

In [105]:
music.groupby(["user_state"])["user_id"].unique().head()

user_state
Alabama                                       [138, 5, 148, 89]
Alaska                                               [195, 106]
Arizona                                                   [105]
Arkansas                                              [124, 78]
California    [110, 121, 97, 159, 72, 194, 112, 192, 55, 160...
Name: user_id, dtype: object

In [107]:
music.groupby(["user_state"])["user_id"].nunique().head() #get unique values count

user_state
Alabama        4
Alaska         2
Arizona        1
Arkansas       2
California    21
Name: user_id, dtype: int64

## Pivot 
pivot_table

In [65]:
music.pivot_table(index=["user_state"],columns="song_played",values="user_id",aggfunc="mean") 
music.pivot_table(index=["user_state"],columns="song_played",values="user_id",aggfunc="max") 
music_pt=music.pivot_table(index=["user_state"],columns="song_played",values="user_id",aggfunc="count",fill_value=0) 
type(music_pt)#data frame 

music_pt.head()

song_played,A Day In The Life,A Hard Day's Night,A Saturday Club Xmas/Crimble Medley,ANYTIME AT ALL,Across The Universe,All My Loving,All You Need Is Love,And Your Bird Can Sing,BAD BOY,BALLAD OF JOHN AND YOKO,...,We Can Work It Out,When I'm 64,While My Guitar Gently Weeps,Wild Honey Pie,With a Little Help From My Friends,YOUR MOTHER SHOULD KNOW,Yellow Submarine,Yesterday,You Never Give Me Your Money,You're Going To Lose That Girl
user_state,,,,,,,,,,,,,,,,,,,,,
Alabama,4,2,0,0,0,0,0,0,0,0,...,2,0,5,0,1,0,0,2,0,0
Alaska,2,1,0,0,0,0,1,0,0,0,...,1,0,4,0,1,0,0,2,0,0
Arizona,1,0,0,0,0,0,0,0,0,0,...,1,0,0,0,1,0,0,1,1,0
Arkansas,0,0,0,0,0,0,0,1,0,0,...,2,0,1,0,0,0,0,1,0,0
California,22,3,0,0,1,1,3,1,1,2,...,13,0,12,5,1,0,2,6,1,0

In [66]:
#sum up values by rows and columns in pivot result (which is also a data frame)
music_pt.sum(axis=1)
#music_pt.sum(axis=0)

user_state
Alabama           104
Alaska             58
Arizona            22
Arkansas           34
California        425
Colorado           54
Connecticut        16
Florida           180
Georgia           135
Idaho              26
Illinois          149
Indiana            55
Iowa               23
Kansas              8
Kentucky           78
Louisiana         105
Maryland          112
Massachusetts      91
Michigan           80
Minnesota          42
Mississippi        85
Missouri          127
Nebraska           36
New Jersey        117
New Mexico         17
New York          469
North Carolina    154
North Dakota       26
Ohio              209
Oklahoma           49
Oregon             62
Pennsylvania      179
Rhode Island       27
South Carolina     85
Tennessee         102
Texas             230
Utah               38
Virginia           17
Washington         41
West Virginia      38
Wisconsin          95
dtype: int64

## create a matrix, works similar as pivot

In [67]:
music.head()
len(np.unique(music['song_played']))#100 unique music
len(np.unique(music['user_state']))#41 unique music
music.groupby("user_state")
##?? not yet implemented

In [108]:
music_pt.sum(axis=1)#sum up value for rows, calculate how many music played for each state 
music_pt.sum(axis=0).sort_values(ascending=False).head()#sum up value for columns, calculate how many music played of each song

song_played
Come Together        408
Revolution           321
Get Back             279
Let It Be            184
A Day In The Life    170
dtype: int64

## Sort values

In [109]:
music.sort_values(by="time_played",ascending=False).head()

,id,song_played,time_played,user_id,user_sign_up_date,user_state
893,ELBEIRCHCJ,Lucy In The Sky With Diamonds,2015-06-28 23:46:06,96,2015-05-12,South Carolina
348,YMSDLTRBTV,Come Together,2015-06-28 23:26:38,158,2015-05-19,North Carolina
3793,PCORCWOBZA,We Can Work It Out,2015-06-28 23:12:51,137,2015-05-17,Wisconsin
2842,IFQGQGOAZN,Paperback Writer,2015-06-28 22:59:27,189,2015-05-20,Florida
911,NSEZTDAJCB,Revolution,2015-06-28 22:58:23,195,2015-05-20,Alaska

# get max and get min

In [70]:
a = np.arange(6).reshape(2,3)
a

array([[0, 1, 2],
       [3, 4, 5]])

In [71]:
#Returns the indices of the maximum values along an axis.
np.argmax(a)
np.argmax(a, axis=0) #array([1, 1, 1], dtype=int64)
#np.argmin(a, axis=0) #array([0, 0, 0], dtype=int64)

array([1, 1, 1], dtype=int64)

# Range

In [72]:
range(10)
range(1,10)

range(1, 10)

# Sample

## sample records from list

In [73]:
import random

list_sample=random.sample(range(len(list)), 5)
list_sample

[3, 9, 7, 0, 8]

# Datetime

## get month from datetime

In [74]:
import datetime
from datetime import timedelta

In [75]:
#define a datetime 
d = datetime.datetime(2015, 9, 10) 
d_next=d+ timedelta(days=1)
print(d)
print(d_next)

2015-09-10 00:00:00
2015-09-11 00:00:00

In [76]:
txnfile="../takehomechallenge/data/credit_card/transactions.csv"
txn=pd.read_csv(txnfile,parse_dates=True)
txn.head()

,credit_card,date,transaction_dollar_amount,Long,Lat
0,1003715054175576,2015-09-11 00:32:40,43.78,-80.174132,40.267370
1,1003715054175576,2015-10-24 22:23:08,103.15,-80.194240,40.180114
2,1003715054175576,2015-10-26 18:19:36,48.55,-80.211033,40.313004
3,1003715054175576,2015-10-22 19:41:10,136.18,-80.174138,40.290895
4,1003715054175576,2015-10-26 20:08:22,71.82,-80.238720,40.166719

In [77]:
#format a column as datetime, using pandas package 
txn['date_date'] = pd.to_datetime(txn.date)

In [110]:
txn.loc[txn['date_date']>d,:].head()

,credit_card,date,transaction_dollar_amount,Long,Lat,date_date,month
0,1003715054175576,2015-09-11 00:32:40,43.78,-80.174132,40.267370,2015-09-11 00:32:40,2015-9
1,1003715054175576,2015-10-24 22:23:08,103.15,-80.194240,40.180114,2015-10-24 22:23:08,2015-10
2,1003715054175576,2015-10-26 18:19:36,48.55,-80.211033,40.313004,2015-10-26 18:19:36,2015-10
3,1003715054175576,2015-10-22 19:41:10,136.18,-80.174138,40.290895,2015-10-22 19:41:10,2015-10
4,1003715054175576,2015-10-26 20:08:22,71.82,-80.238720,40.166719,2015-10-26 20:08:22,2015-10

In [79]:
def getMonth(date_str):
    date=datetime.datetime.strptime(date_str, "%Y-%m-%d %H:%M:%S")
    return(str(date.year)+'-'+str(date.month))

In [80]:
def toDateTime(str):
    return(datetime.datetime.strptime(str, "%Y-%m-%d %H:%M:%S"))
#sample usage
#data2["date"]=data2["date"].apply(toDateTime)

In [81]:
txn['month']=txn['date'].apply(getMonth)

In [173]:
#calculate rolling 10 days amount for each credit card
def getRolling10Days(date_i,cc,df):
    amt=df.loc[(df.date_date<date_i) & (df.date_date>date_i-timedelta(days=10)) &(df.credit_card==cc)]['transaction_dollar_amount'].sum()
    return amt

In [180]:
txn_sample=txn.head(1000)
txn_sample.groupby('credit_card').size()

credit_card
1003715054175576    261
1013870087888817    341
1023820165155391    398
dtype: int64

In [182]:
result=txn_sample['date_date'].apply(getRolling10Days,cc=txn_sample['credit_card'],df=txn_sample) 
txn_sample['rolling_total']=result

C:\Users\shanchen\AppData\Local\Enthought\Canopy\edm\envs\User\lib\site-packages\ipykernel\__main__.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  from ipykernel import kernelapp as app

In [189]:
txn_sample.loc[(txn_sample['credit_card']==1013870087888817) & (txn_sample['date_date']<d_next),:].sort_values(by='date_date')

,credit_card,date,transaction_dollar_amount,Long,Lat,date_date,month,rolling_total
506,1013870087888817,2015-07-31 18:24:45,52.44,-72.178895,43.195511,2015-07-31 18:24:45,2015-7,411.55
392,1013870087888817,2015-07-31 18:24:47,73.89,-72.124877,43.214593,2015-07-31 18:24:47,2015-7,463.99
389,1013870087888817,2015-07-31 19:31:11,73.72,-72.039532,43.207551,2015-07-31 19:31:11,2015-7,537.88
579,1013870087888817,2015-07-31 21:15:08,81.38,-72.057612,43.176706,2015-07-31 21:15:08,2015-7,955.62
556,1013870087888817,2015-08-01 18:11:34,105.54,-72.046728,43.220051,2015-08-01 18:11:34,2015-8,1755.90
358,1013870087888817,2015-08-01 18:18:23,118.86,-72.027981,43.153299,2015-08-01 18:18:23,2015-8,1861.44
501,1013870087888817,2015-08-01 19:41:59,114.80,-72.035413,43.175898,2015-08-01 19:41:59,2015-8,2138.92
366,1013870087888817,2015-08-01 20:47:42,152.65,-72.081872,43.097129,2015-08-01 20:47:42,2015-8,2343.82
328,1013870087888817,2015-08-01 22:34:22,78.88,-72.085300,43.204330,2015-08-01 22:34:22,2015-8,2571.34
368,1013870087888817,2015-08-02 01:01:05,95.79,-72.184626,43.188291,2015-08-02 01:01:05,2015-8,3620.72
510,1013870087888817,2015-08-02 20:37:15,25.20,-72.075695,43.132618,2015-08-02 20:37:15,2015-8,3946.34
547,1013870087888817,2015-08-02 21:16:19,56.98,-72.146238,43.153029,2015-08-02 21:16:19,2015-8,3971.54
400,1013870087888817,2015-08-04 13:31:43,105.79,-72.176369,43.156524,2015-08-04 13:31:43,2015-8,5636.98
468,1013870087888817,2015-08-04 18:45:30,25.97,-72.112287,43.243267,2015-08-04 18:45:30,2015-8,5880.80
589,1013870087888817,2015-08-04 21:04:02,21.49,35.287555,47.606486,2015-08-04 21:04:02,2015-8,5906.77
383,1013870087888817,2015-08-05 13:19:58,107.99,-72.011720,43.166334,2015-08-05 13:19:58,2015-8,6745.67
469,1013870087888817,2015-08-05 18:28:04,86.73,-72.032170,43.136691,2015-08-05 18:28:04,2015-8,6995.73
588,1013870087888817,2015-08-05 20:52:09,75.60,-72.108078,43.138276,2015-08-05 20:52:09,2015-8,7197.57
347,1013870087888817,2015-08-05 22:21:04,127.48,-72.143295,43.135688,2015-08-05 22:21:04,2015-8,7273.17
572,1013870087888817,2015-08-06 17:02:14,150.95,-72.075345,43.183584,2015-08-06 17:02:14,2015-8,7733.89
276,1013870087888817,2015-08-06 20:52:41,12.41,-72.124650,43.200504,2015-08-06 20:52:41,2015-8,8150.65
291,1013870087888817,2015-08-06 22:58:17,170.83,-72.105506,43.138697,2015-08-06 22:58:17,2015-8,8916.08
289,1013870087888817,2015-08-06 23:07:17,173.06,-72.078934,43.194725,2015-08-06 23:07:17,2015-8,9224.07
279,1013870087888817,2015-08-06 23:29:44,192.69,-72.080751,43.239949,2015-08-06 23:29:44,2015-8,9397.13
554,1013870087888817,2015-08-06 23:55:48,9.17,-72.098950,43.096081,2015-08-06 23:55:48,2015-8,9647.38
475,1013870087888817,2015-08-07 01:51:06,148.77,-72.079509,43.198195,2015-08-07 01:51:06,2015-8,9919.65
558,1013870087888817,2015-08-07 14:46:23,75.03,-72.110308,43.187046,2015-08-07 14:46:23,2015-8,10139.44
559,1013870087888817,2015-08-07 14:46:24,53.18,-72.152025,43.126429,2015-08-07 14:46:24,2015-8,10214.47
560,1013870087888817,2015-08-07 14:46:25,19.41,-72.135385,43.094440,2015-08-07 14:46:25,2015-8,10267.65
463,1013870087888817,2015-08-07 16:32:25,111.69,-72.108147,43.175961,2015-08-07 16:32:25,2015-8,10287.06
...,...,...,...,...,...,...,...,...
312,1013870087888817,2015-09-03 15:41:32,92.33,-72.154373,43.239579,2015-09-03 15:41:32,2015-9,13361.46
372,1013870087888817,2015-09-03 20:08:34,93.78,-72.045528,43.148084,2015-09-03 20:08:34,2015-9,13501.57
353,1013870087888817,2015-09-03 20:23:08,91.64,-72.150857,43.236199,2015-09-03 20:23:08,2015-9,13704.33
427,1013870087888817,2015-09-03 21:13:52,62.13,-72.139913,43.194271,2015-09-03 21:13:52,2015-9,14234.58
344,1013870087888817,2015-09-03 21:54:22,140.34,-72.095244,43.091459,2015-09-03 21:54:22,2015-9,14193.89
441,1013870087888817,2015-09-03 23:26:34,131.31,-72.088419,43.219457,2015-09-03 23:26:34,2015-9,13296.43
459,1013870087888817,2015-09-04 02:16:04,149.19,-72.076189,43.152376,2015-09-04 02:16:04,2015-9,13427.74
356,1013870087888817,2015-09-04 16:19:08,194.92,-72.070717,43.173393,2015-09-04 16:19:08,2015-9,13526.50
330,1013870087888817,2015-09-04 21:48:51,130.15,-72.099397,43.228109,2015-09-04 21:48:51,2015-9,13761.18
325,1013870087888817,2015-09-04 22:08:39,138.72,-72.150453,43.185610,2015-09-04 22:08:39,2015-9,14266.43
340,1013870087888817,2015-09-04 23:31:17,91.17,-72.042236,43.224949,2015-09-04 23:31:17,2015-9,14290.94
321,1013870087888817,2015-09-05 17:16:30,30.74,-72.115626,43.090692,2015-09-05 17:16:30,2015-9,14168.67
402,1013870087888817,2015-09-05 18:27:01,70.75,-72.164223,43.136403,2015-09-05 18:27:01,2015-9,14199.41
294,1013870087888817,2015-09-07 13:50:01,130.22,-72.093232,43.185075,2015-09-07 13:50:01,2015-9,12732.39
397,1013870087888817,2015-09-07 20:05:21,175.83,-72.099518,43.161484,2015-09-07 20:05:21,2015-9,12331.87
435,1013870087888817,2015-09-07 20:16:57,150.91,-72.161978,43.140528,2015-09-07 20:16:57,2015-9,12507.70
317,1013870087888817,2015-09-07 23:25:57,98.59,-72.076267,43.113442,2015-09-07 23:25:57,2015-9,12396.97
292,1013870087888817,2015-09-08 20:44:01,63.26,-72.135680,43.098407,2015-09-08 20:44:01,2015-9,11927.27
334,1013870087888817,2015-09-08 21:21:50,56.05,-72.046149,43.215496,2015-09-08 21:21:50,2015-9,12078.24
595,1013870087888817,2015-09-08 22:04:10,73.29,-72.075657,43.244070,2015-09-08 22:04:10,2015-9,12392.34
541,1013870087888817,2015-09-09 16:39:37,77.00,-72.103097,43.241947,2015-09-09 16:39:37,2015-9,12363.15
414,1013870087888817,2015-09-09 17:22:26,38.44,-72.146896,43.239645,2015-09-09 17:22:26,2015-9,12440.15
591,1013870087888817,2015-09-09 18:14:56,69.48,-72.032035,43.204221,2015-09-09 18:14:56,2015-9,12478.59
457,1013870087888817,2015-09-09 20:24:07,100.65,-72.082385,43.123128,2015-09-09 20:24:07,2015-9,12995.85
350,1013870087888817,2015-09-09 21:02:52,67.75,-72.153535,43.242490,2015-09-09 21:02:52,2015-9,13019.80
526,1013870087888817,2015-09-10 16:27:46,110.54,-72.018701,43.138995,2015-09-10 16:27:46,2015-9,13238.97
472,1013870087888817,2015-09-10 18:01:44,21.85,-72.022041,43.156432,2015-09-10 18:01:44,2015-9,13399.10
456,1013870087888817,2015-09-10 18:24:17,0.81,-72.077798,43.204047,2015-09-10 18:24:17,2015-9,13443.26
361,1013870087888817,2015-09-10 18:28:49,100.83,-72.025030,43.120595,2015-09-10 18:28:49,2015-9,13444.07
546,1013870087888817,2015-09-10 19:55:14,87.83,-72.077087,43.152572,2015-09-10 19:55:14,2015-9,13651.75

In [184]:
d = datetime.datetime(2015, 9, 10) 
#单独测试这个function，答案是预期的，但是看txn_sample['rolling_total'] 这个column的value就没有那么正确了
getRolling10Days(d,1013870087888817,txn_sample)

4891.3199999999997

In [82]:
#.dt.days, can be calculated for days difference between 2 date columns
#data['days_latency']=(data['date']-data['signup_date']).dt.days

In [83]:
txn.head()

,credit_card,date,transaction_dollar_amount,Long,Lat,date_date,month
0,1003715054175576,2015-09-11 00:32:40,43.78,-80.174132,40.267370,2015-09-11 00:32:40,2015-9
1,1003715054175576,2015-10-24 22:23:08,103.15,-80.194240,40.180114,2015-10-24 22:23:08,2015-10
2,1003715054175576,2015-10-26 18:19:36,48.55,-80.211033,40.313004,2015-10-26 18:19:36,2015-10
3,1003715054175576,2015-10-22 19:41:10,136.18,-80.174138,40.290895,2015-10-22 19:41:10,2015-10
4,1003715054175576,2015-10-26 20:08:22,71.82,-80.238720,40.166719,2015-10-26 20:08:22,2015-10

In [84]:
#format a column from timestamp into dates, 
#pd.to_datetime(data['timestamp'], unit='s')

# fillna

In [111]:
#refer to 12 loan granting as concrete example https://github.com/JifuZhao/DS-Take-Home/blob/master/12.%20Loan%20Granting.ipynb
median = data['avg_percentage_credit_card_limit_used_last_year'].median()
data = data.fillna({'avg_percentage_credit_card_limit_used_last_year': median})

# isnull

In [86]:
referral=pd.read_csv('../TakeHomeChallenge/data/referral.csv')
sum(pd.isnull(referral.money_spent)) #check number of rows with null value

0

In [88]:
#Create a new function:
def num_missing(x):
  return sum(x.isnull())

#Applying per column:
print("Missing values per column:")
print(referral.apply(num_missing, axis=0) )#axis=0 defines that function is to be applied on each column

#Applying per row:
print("\nMissing values per row:")
print(referral.apply(num_missing, axis=1).head()) #axis=1 defines that function is to be applied on each row

Missing values per column:
user_id        0
date           0
country        0
money_spent    0
is_referral    0
device_id      0
dtype: int64

Missing values per row:
0    0
1    0
2    0
3    0
4    0
dtype: int64

# AB Test

In [89]:
from scipy import stats
np.random.seed(12345678)
rvs1 = stats.norm.rvs(loc=5,scale=10,size=500)
rvs2 = stats.norm.rvs(loc=5,scale=10,size=500)
stats.ttest_ind(rvs1,rvs2) 
#statistic = The calculated t-statistic.
#pvalue = The two-tailed p-value.

#With symmetric distributions one-sided p-value is just half of the two-sided pvalue

Ttest_indResult(statistic=0.26833823296238857, pvalue=0.78849443369565098)

It goes on to say that scipy always gives the test statistic as signed. This means that given p and t values from a two-tailed test, you would reject the null hypothesis of a greater-than test when p/2 < alpha and t > 0, and of a less-than test when p/2 < alpha and t < 0.
reference: https://stackoverflow.com/questions/15984221/how-to-perform-two-sample-one-tailed-t-test-with-numpy-scipy

In [90]:
#print format to 4 decimals
f=0.87655
print('result is {0:.4f}'.format(f))

result is 0.8766

# lambda function
lambda function and if condition

In [91]:
#data['first_time']=data['days_latency'].apply(lambda x: True if x  == 0 else False)

# lagging function

In [92]:
df['Data_lagged'] = df.groupby(['Group'])['Data'].shift(1)
#https://stackoverflow.com/questions/23664877/pandas-equivalent-of-oracle-lead-lag-function
#when using shift function, df has to been sorted as way you want.

NameError: name 'df' is not defined

# mode, median, average

In [93]:
from scipy.stats import mode
print(sum(pd.isnull(referral.country))) #check number of rows with null value
print(mode(referral['country']))
mode(referral['country']).mode[0] #returns value of mode values
mode(referral['country']).count[0] #returns value of mode values

0
ModeResult(mode=array(['UK'], dtype=object), count=array([15493]))

C:\Users\shanchen\AppData\Local\Enthought\Canopy\edm\envs\User\lib\site-packages\scipy\stats\stats.py:253: RuntimeWarning: The input array could not be properly checked for nan values. nan values will be ignored.
  "values. nan values will be ignored.", RuntimeWarning)

15493

In [94]:
#use percentitle method to get median
print(referral.quantile(.5)) #get percentile value for data frame 
print(referral.quantile(.5).loc['money_spent']) #get median value for certain attribute

user_id        4053.0
money_spent      42.0
is_referral       0.0
Name: 0.5, dtype: float64
42.0

In [95]:
#get average value 
referral['money_spent'].mean()

44.692359848368106

In [96]:
referral.head()

   user_id        date country  money_spent  is_referral      device_id
0        2  2015-10-03      FR           65            0  EVDCJTZMVMJDG
1        3  2015-10-03      CA           54            0  WUBZFTVKXGQQX
2        6  2015-10-03      FR           35            0  CBAPCJRTFNUJG
3        7  2015-10-03      UK           73            0  PRGXJZAJKMXRH
4        7  2015-10-03      MX           35            0  PRGXJZAJKMXRH

# crosstab
excel like pivot

In [97]:
pd.crosstab(referral["is_referral"],referral["country"],margins=True)

country        CA    CH     DE    ES     FR     IT    MX     UK     US    All
is_referral
0            6934   950   8515  6769  10648   7864  5594  10905  11145  69324
1            2506   279   2578  3062   4748   3582  2539   4588   4135  28017
All          9440  1229  11093  9831  15396  11446  8133  15493  15280  97341

In [98]:
def percConvert(ser):
  return ser/float(ser[-1])
pd.crosstab(referral["is_referral"],referral["country"],margins=True).apply(percConvert, axis=1)

country,CA,CH,DE,ES,FR,IT,MX,UK,US,All
is_referral,,,,,,,,,,
0,0.100023,0.013704,0.122829,0.097643,0.153598,0.113438,0.080694,0.157305,0.160767,1.0
1,0.089446,0.009958,0.092016,0.109291,0.169469,0.127851,0.090624,0.163758,0.147589,1.0
All,0.096979,0.012626,0.113960,0.100995,0.158166,0.117587,0.083552,0.159162,0.156974,1.0

# metrics definition

In [113]:
def calcMetrics(df):
    ctr=df['clicked'].sum()/df['shown'].sum()
    conv=df['converted'].sum()/df['shown'].sum()
    roi=df['total_revenue'].sum()/((df['clicked']*df['avg_cost_per_click']).sum())
    return pd.Series({'ctr':ctr,
                      'conv': conv,
                      'roi':roi})